Algorithms/AhoCorasick/Blog.org
#+TITLE: String Matching and AhoCorasick
#+OPTIONS: author:t email:t creator:nil date:nil timestamp:nil toc:100
#+EMAIL:deanzhu2@gmail.com
#+AUTHOR:Dean Zhu

Hello Everyone, this is my first Algorithms blog and hopefully not the last.
Today I am going to explain the Aho-Corasick algorithm for multiple pattern matching, with my implementation and several possible modifications. \\
The objective is that at the end of the blog you are able to understand fully the algorithm, and actually implemented yourself.

Useful Previous Knowledge: *KMP, string matching*, *Automata*\\
Must have Knowledge: *Trie*\\
Notation:
- *S*[i..j] is the substring of S from position *i* to *j*, indexed at 0, inclusive on *i* and exclusive *j*
- *|S|* is the size of *S*

In the first section I am going to explain the *KMP Algorithm* (Knuth-Morris-Pratt), if you understand how the SuffixLinks work you can skip to the next section

* *String Matching and KMP*
Let's consider the following problem: We are given 2 strings *S* and *T* and we are asked to check if S is a substring of *T*.



** *Naive Solution*
We can naively compute the solution by checking if *S* matches
*T[i..i+|S|]* for some *i*, this takes *O(n)* for each substring by
checking each letter one by one, this runs in a total complexity of
*O(n^{2})*.  There is a constant time solution to compare them using
hashing, but I won't cover it right now.

** *KMP O(n) Solution*
Let's forget the original problem for a second and think about this
one instead: Given the strings *S* we want to compute for each
*S[0..i]* what is the largest *x_{i}* different to *i* such that
*S[i-x_{i}..i] = S[0..x_{i}]*. (if x_{i} = i, we have that it always
matches as it is the same Substring) \\
If we can solve this problem then it's clear that if we use the string
*R = S+$+T* (*R[0..|S|]* is exactly *S*, *R[|S|+1..|S|+|T|+1]* is
exactly *T* and *$* is some character which is not in our alphabet)
and find an *i \geq |S| + 1* such that *x_{i} = |S|* we have actually
found a place where *S* is a substring of *T*, so we have also found
solution to our original problem. Let's try to solve it in O(n).

*** *Prefix function*
It might be beneficial to know that *x_{i}* is also known as the Prefix
Function.

*Prefix*: is any string of the form S[0..i]. \\
*Proper prefix*: is any prefix different to the original string. \\
*Suffix*: is any string of the form S[i..|S|]. \\
*Proper Suffix*: is any suffix different to the original string. \\

With the given definitions we can see that *x_{i}* corresponds to the
largest proper prefix which is also a proper suffix of our string
*S[0..i]*. Indeed as we have that *S[i-x_{i}..i] = S[0..x_{i}]*, we
know that *S[0..x_{i}]* is a prefix of *S* and *S[i-x_{i}..i]* is a
suffix of *S*. From now one any prefix that is also a suffix will be
called *Border*.\\
Returning to our second problem, we are actually looking for the
longest Border in string *S*.

**** *The Border of a Border is still a Border.*
That title sounded a little complicated, lets go by parts.\\
Lets consider *S* and its border *S[0..i]*, and now lets consider a
border of *S[0..i]* and lets note it by *S[0..j], j \lt i*.  It's
obvious that *S[0..j]* is a proper prefix of *S*. \\
Let's see that it is also a suffix. We know that *S[i-j..i] = S[0..j]*
because it is a border. Then it is clear that *S[0..j]* is actually
the same as *S[0..i]* after taking away some letters at the beggining
of *S[0..i]*. And we know that *S[0..i]* is a suffix of *S*. That
means *S[0..j]* is also Suffix of *S*. You might need to read it a few
times or writing an example down. The following might also help you
think. Lets say we have *T* and *T[i..|T|]* which is a suffix of T, if
we take away a few letters from the beggining of *T[i..|T|]* will it
still a suffix of *T*? The answer is clearly yes.

**** *x_{i} + 1 \geq x{i+1}*
Let's see how the length of the border behaves. \\
Lets consider *S[0..j]* a border of *S[0..i]*, if we consider
*S[0..j+1]* and *S[0..i+1]*, it is quite obvious that if *S[j]* =
*S[i]* then the *S[0..j+1]* is a border of *S[0..i+1]*. (Note that it
is *j* and *i* because we are right-exclusive). What would happen if
we find a *k* such that *j + 1 < k < i + 1* and *S[0..k]* is a border
of *S[0..i+1]* ? That would mean that *S[0..k-1]* is a border of
*S[0..i]* which would mean that *S[0..j]* was not the longest border
of *S[0..i]* which is a contradiction.

*** *KMP*
  Knowing the above facts we can start building our Prefix function
  *x_{i}* in linear time. We are going to build this from the shortest
  prefix to the whole String *S*. \\
  Imagine we are at an intermediate step and we want to know the
  longest border of *S[0..i+1]*. We have seen above that if *S[i] =
  S[x_{i}]* then x_{i+1} = x_{i} + 1.(Note that *x_{i}* is *j* in the
  example given above) so this case is solved. Lets suppose that *S[i]
  \neq S[x_{i}]*, how can we find the longest border for *i+1* now? We
  know that *S[0..x_{i}]* is a border of *S[0..i]*, and as we know
  /"The Border of a Border is still a Border."/, so actually
  *S[0..x_{x_{i}}]* is also a border of *S[0..i]*. And we know that it
  is the longest border of *S[0..x_{i}]* which means that it is the
  second longest border of *S[0..i]* so we can now check if *S[i] =
  S[x_{x_{i}}]* until we find a match.

#+BEGIN_SRC cpp
  string S;
  vector<int> x(S.size() + 1, -1);
  int k = -1;
  for (int i = 0; i < S.size(); ++i) {
      k = x[i];
      while (k > -1 and S[i] != S[k]) k = x[k];
      //While S[i] != S[x_{i}] we check for the longest border of the longest border.
      //If we never find a match that means that the longest border is empty
      x[i+1] = k+1; // We know that x_{i+1} is the length of the last border + 1
  }
#+END_SRC
