Algorithms/AhoCorasick/Blog.html
<!doctype html>
<html lang="en">
<head>
<title>String Matching and AhoCorasick</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Dean Zhu">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">String Matching and AhoCorasick</h1>
<p>
Hello Everyone, this is my first Algorithms blog and hopefully not the last.
Today I am going to explain the Aho-Corasick algorithm for multiple pattern matching, with my implementation and several possible modifications. <br >
The objective is that at the end of the blog you are able to understand fully the algorithm, and actually implemented yourself.
</p>

<p>
Useful Previous Knowledge: <b>KMP, string matching</b>, <b>Automata</b><br >
Must have Knowledge: <b>Trie</b><br >
Notation:
</p>
<ul class="org-ul">
<li><b>S</b>[i..j] is the substring of S from position <b>i</b> to <b>j</b>, indexed at 0, inclusive on <b>i</b> and exclusive <b>j</b>
</li>
<li><b>|S|</b> is the size of <b>S</b>
</li>
</ul>

<p>
In the first section I am going to explain the <b>KMP Algorithm</b> (Knuth-Morris-Pratt), if you understand how the SuffixLinks work you can skip to the next section
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <b>String Matching and KMP</b></h2>
<div class="outline-text-2" id="text-1">
<p>
Let's consider the following problem: We are given 2 strings <b>S</b> and <b>T</b> and we are asked to check if S is a substring of <b>T</b>.
</p>
</div>



<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <b>Naive Solution</b></h3>
<div class="outline-text-3" id="text-1-1">
<p>
We can naively compute the solution by checking if <b>S</b> matches
<b>T[i..i+|S|]</b> for some <b>i</b>, this takes <b>O(n)</b> for each substring by
checking each letter one by one, this runs in a total complexity of
<b>O(n<sup>2</sup>)</b>.  There is a constant time solution to compare them using
hashing, but I won't cover it right now.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <b>KMP O(n) Solution</b></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Let's forget the original problem for a second and think about this
one instead: Given the strings <b>S</b> we want to compute for each
<b>S[0..i]</b> what is the largest <b>x<sub>i</sub></b> different to <b>i</b> such that
<b>S[i-x<sub>i</sub>..i] = S[0..x<sub>i</sub>]</b>. (if x<sub>i</sub> = i, we have that it always
matches as it is the same Substring) <br >
If we can solve this problem then it's clear that if we use the string
<b>R = S+$+T</b> (<b>R[0..|S|]</b> is exactly <b>S</b>, <b>R[|S|+1..|S|+|T|+1]</b> is
exactly <b>T</b> and <b>$</b> is some character which is not in our alphabet)
and find an <b>i &ge; |S| + 1</b> such that <b>x<sub>i</sub> = |S|</b> we have actually
found a place where <b>S</b> is a substring of <b>T</b>, so we have also found
solution to our original problem. Let's try to solve it in O(n).
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <b>Prefix function</b></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
It might be beneficial to know that <b>x<sub>i</sub></b> is also known as the Prefix
Function.
</p>

<p>
<b>Prefix</b>: is any string of the form S[0..i]. <br >
<b>Proper prefix</b>: is any prefix different to the original string. <br >
<b>Suffix</b>: is any string of the form S[i..|S|]. <br >
<b>Proper Suffix</b>: is any suffix different to the original string. <br >
</p>

<p>
With the given definitions we can see that <b>x<sub>i</sub></b> corresponds to the
largest proper prefix which is also a proper suffix of our string
<b>S[0..i]</b>. Indeed as we have that <b>S[i-x<sub>i</sub>..i] = S[0..x<sub>i</sub>]</b>, we
know that <b>S[0..x<sub>i</sub>]</b> is a prefix of <b>S</b> and <b>S[i-x<sub>i</sub>..i]</b> is a
suffix of <b>S</b>. From now one any prefix that is also a suffix will be
called <b>Border</b>.<br >
Returning to our second problem, we are actually looking for the
longest Border in string <b>S</b>.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a><b>The Border of a Border is still a Border.</b><br ><div class="outline-text-5" id="text-1-2-1-1">
<p>
That title sounded a little complicated, lets go by parts.<br >
Lets consider <b>S</b> and its border <b>S[0..i]</b>, and now lets consider a
border of <b>S[0..i]</b> and lets note it by <b>S[0..j], j &lt; i</b>.  It's
obvious that <b>S[0..j]</b> is a proper prefix of <b>S</b>. <br >
Let's see that it is also a suffix. We know that <b>S[i-j..i] = S[0..j]</b>
because it is a border. Then it is clear that <b>S[0..j]</b> is actually
the same as <b>S[0..i]</b> after taking away some letters at the beggining
of <b>S[0..i]</b>. And we know that <b>S[0..i]</b> is a suffix of <b>S</b>. That
means <b>S[0..j]</b> is also Suffix of <b>S</b>. You might need to read it a few
times or writing an example down. The following might also help you
think. Lets say we have <b>T</b> and <b>T[i..|T|]</b> which is a suffix of T, if
we take away a few letters from the beggining of <b>T[i..|T|]</b> will it
still a suffix of <b>T</b>? The answer is clearly yes.
</p>
</div>
</li>

<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a><b>x<sub>i</sub> + 1 &ge; x{i+1}</b><br ><div class="outline-text-5" id="text-1-2-1-2">
<p>
Let's see how the length of the border behaves. <br >
Lets consider <b>S[0..j]</b> a border of <b>S[0..i]</b>, if we consider
<b>S[0..j+1]</b> and <b>S[0..i+1]</b>, it is quite obvious that if <b>S[j]</b> =
<b>S[i]</b> then the <b>S[0..j+1]</b> is a border of <b>S[0..i+1]</b>. (Note that it
is <b>j</b> and <b>i</b> because we are right-exclusive). What would happen if
we find a <b>k</b> such that <b>j + 1 &lt; k &lt; i + 1</b> and <b>S[0..k]</b> is a border
of <b>S[0..i+1]</b> ? That would mean that <b>S[0..k-1]</b> is a border of
<b>S[0..i]</b> which would mean that <b>S[0..j]</b> was not the longest border
of <b>S[0..i]</b> which is a contradiction.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> <b>KMP</b></h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Knowing the above facts we can start building our Prefix function
<b>x<sub>i</sub></b> in linear time. We are going to build this from the shortest
prefix to the whole String <b>S</b>. <br >
Imagine we are at an intermediate step and we want to know the
longest border of <b>S[0..i+1]</b>. We have seen above that if <b>S[i] =
S[x<sub>i</sub>]</b> then x<sub>i+1</sub> = x<sub>i</sub> + 1.(Note that <b>x<sub>i</sub></b> is <b>j</b> in the
example given above) so this case is solved. Lets suppose that <b>S[i]
&ne; S[x<sub>i</sub>]</b>, how can we find the longest border for <b>i+1</b> now? We
know that <b>S[0..x<sub>i</sub>]</b> is a border of <b>S[0..i]</b>, and as we know
<i>"The Border of a Border is still a Border."</i>, so actually
<b>S[0..x<sub>x<sub>i</sub></sub>]</b> is also a border of <b>S[0..i]</b>. And we know that it
is the longest border of <b>S[0..x<sub>i</sub>]</b> which means that it is the
second longest border of <b>S[0..i]</b> so we can now check if <b>S[i] =
S[x<sub>x<sub>i</sub></sub>]</b> until we find a match.
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #ECBE7B;">string</span> <span style="color: #dcaeea;">S</span>;
<span style="color: #ECBE7B;">vector</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">x</span><span style="color: #51afef;">(</span>S.size<span style="color: #c678dd;">()</span> + 1, -1<span style="color: #51afef;">)</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">k</span> = -1;
<span style="color: #51afef;">for</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; S.size<span style="color: #c678dd;">()</span>; ++i<span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    k = x<span style="color: #c678dd;">[</span>i<span style="color: #c678dd;">]</span>;
    <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span>k &gt; -1 <span style="color: #51afef;">and</span> S<span style="color: #98be65;">[</span>i<span style="color: #98be65;">]</span> != S<span style="color: #98be65;">[</span>k<span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span> k = x<span style="color: #c678dd;">[</span>k<span style="color: #c678dd;">]</span>;
    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">While S[i] != S[x_{i}] we check for the longest border of the longest border.</span>
    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">If we never find a match that means that the longest border is empty</span>
    x<span style="color: #c678dd;">[</span>i+1<span style="color: #c678dd;">]</span> = k+1; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">We know that x_{i+1} is the length of the last border + 1</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
