Algorithms/AhoCorasick/Blog.org
*** *Complexity Analysis*
So after checking on this code you might wonder the complexity of KMP
and doubt my claim that it is linear, lets prove it.\\
In our code we have 2 loops, the outer loop and the inner loop. Let's
calculate maximum number of iterations by checking how many possible
modifications we can make to *k*, notice when we change go to the next
iteration k increases by one. Check that this code is equivalent to
the last one.

#+BEGIN_SRC cpp
  for (int i = 0; i < S.size(); ++i, ++k) {
      while (k > -1 and S[i] != S[k]) k = x[k];
      x[i+1] = k+1;
  }
#+END_SRC

In the inner loop we decrease *k* by a non zero value at each iteration,
but never to a value below 0. \\
What does it mean? We know that we increase *k |S|* times, and we can
decrease it to 0 as many times as we want, but as we have only
increase it *|S|* times it is impossible to decrease it more times as
then *k* would forcefully be negative. Hence we at most do *2|S|*
iterations.

If you understood the above correctly remember that what we did by
going to *x_{x_{i}}* (k = x[k]) is akin navigating through the
*suffix links*, where a suffix link points to the longest border.  Now
you should be able to see if S is a substring of T in linear time, you
can try it out in this link [[https://jutge.org/problems/P33597_en][Online Jutge]] (You might need an account
first).



* *String Matching and AhoCorasick*
Now let's consider a new problem, we are given *M* patterns *P_{i}* and are asked to see if they appear in a string *S*.

** *Naive Solution*
   Now the naive solution can be comparing each of the *M* strings to
   match against *S*, which gives us a
   $O(\sum\limits_i^M |P_{i}| * |S|)$, if we decide to use the KMP
   method here it would still give us a $O(M*|S|) which seems good
   enough, can we do better though?

** *Generalizaing the KMP algorithm*
   We have seen that the KMP algorithm is every fast when matching a
   single string, how can we generalize it to multiple patterns? \\
   Let's create an *Automata* to represent the data, an *Automata* is
   simply a graph where the *Nodes are states* and *Edges are
   transitions*, there is also an *Initial state* and some *End
   states* that indicate that a pattern ends at that *state*. \\

*** *Building the skeleton*
   How would we want the automata so we can solve our problem easily?
   First of all we would need it to lead us to an *End state* if we
   feed a pattern to it at the *Initial State*. The way to build this
   is simply using a *Trie*, this will be the skeleton of our Automata. \\
   I won't go into too much detail, as it is a very elementary data-structure.
   This should be your standard Trie Building function:
#+BEGIN_SRC cpp
  struct node{
      int nxt[Alpha] = {}; //Alpha is the number of transitions.
      char c;
  };
  vector<node> V(1000000);
  //0 will be our initial state

  int getval(char c); //we map each transition to an integer.
  int lst = 1;
  void BuildTrie(vector<string> &v) {
      for(auto &s : v) {
          int pos = 0;
          for(char &c : s) {
              int val = getval(c);
              if(!V[pos].nxt[val]) {
                  V[lst].c = c; V[pos].nxt[val] = lst++;
                  SaveSomeData();
                  //suppose we save some needed information here
              }
              pos = V[pos].nxt[val];
          }
          SaveSomeEndStateData();
          //suppose we save some data at the End State
      }
  }
#+END_SRC

*** *Building the rest*
Now we ask ourselves a question, what if in the middle of the pattern
we encounter a character which has no corresponding transition? \\
Let's think what we did in the KMP, whenever we found a matching
character we simply increased the border by one, the equivalent would be going to the next state. Whenever we found a not matching character we
would compare it to *x_{x_{i}}*. We are going to do the same here, we
are going to find the "Prefix Function" in our Automata.

