Algorithms/AhoCorasick/Blog.html
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> <b>Complexity Analysis</b></h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
So after checking on this code you might wonder the complexity of KMP
and doubt my claim that it is linear, lets prove it.<br >
In our code we have 2 loops, the outer loop and the inner loop. Let's
calculate maximum number of iterations by checking how many possible
modifications we can make to <b>k</b>, notice when we change go to the next
iteration k increases by one. Check that this code is equivalent to
the last one.
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #51afef;">for</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; S.size<span style="color: #c678dd;">()</span>; ++i, ++k<span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span>k &gt; -1 <span style="color: #51afef;">and</span> S<span style="color: #98be65;">[</span>i<span style="color: #98be65;">]</span> != S<span style="color: #98be65;">[</span>k<span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span> k = x<span style="color: #c678dd;">[</span>k<span style="color: #c678dd;">]</span>;
    x<span style="color: #c678dd;">[</span>i+1<span style="color: #c678dd;">]</span> = k+1;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
In the inner loop we decrease <b>k</b> by a non zero value at each iteration,
but never to a value below 0. <br >
What does it mean? We know that we increase <b>k |S|</b> times, and we can
decrease it to 0 as many times as we want, but as we have only
increase it <b>|S|</b> times it is impossible to decrease it more times as
then <b>k</b> would forcefully be negative. Hence we at most do <b>2|S|</b>
iterations.
</p>

<p>
If you understood the above correctly remember that what we did by
going to <b>x<sub>x<sub>i</sub></sub></b> (k = x[k]) is akin navigating through the
<b>suffix links</b>, where a suffix link points to the longest border.  Now
you should be able to see if S is a substring of T in linear time, you
can try it out in this link <a href="https://jutge.org/problems/P33597_en">Online Jutge</a> (You might need an account
first).
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <b>String Matching and AhoCorasick</b></h2>
<div class="outline-text-2" id="text-2">
<p>
Now let's consider a new problem, we are given <b>M</b> patterns <b>P<sub>i</sub></b> and are asked to see if they appear in a string <b>S</b>.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <b>Naive Solution</b></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Now the naive solution can be comparing each of the <b>M</b> strings to
match against <b>S</b>, which gives us a
\(O(\sum\limits_i^M |P_{i}| * |S|)\), if we decide to use the KMP
method here it would still give us a $O(M*|S|) which seems good
enough, can we do better though?
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <b>Generalizaing the KMP algorithm</b></h3>
<div class="outline-text-3" id="text-2-2">
<p>
We have seen that the KMP algorithm is every fast when matching a
single string, how can we generalize it to multiple patterns? <br >
Let's create an <b>Automata</b> to represent the data, an <b>Automata</b> is
simply a graph where the <b>Nodes are states</b> and <b>Edges are
transitions</b>, there is also an <b>Initial state</b> and some <b>End
states</b> that indicate that a pattern ends at that <b>state</b>. <br >
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> <b>Building the skeleton</b></h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
How would we want the automata so we can solve our problem easily?
First of all we would need it to lead us to an <b>End state</b> if we
feed a pattern to it at the <b>Initial State</b>. The way to build this
is simply using a <b>Trie</b>, this will be the skeleton of our Automata. <br >
I won't go into too much detail, as it is a very elementary data-structure.
This should be your standard Trie Building function:
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">node</span><span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nxt</span><span style="color: #c678dd;">[</span>Alpha<span style="color: #c678dd;">]</span> = <span style="color: #c678dd;">{}</span>; <span style="color: #5B6268;">//</span><span style="color: #5B6268;">Alpha is the number of transitions.</span>
    <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span>;
<span style="color: #51afef;">}</span>;
<span style="color: #ECBE7B;">vector</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">node</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">V</span><span style="color: #51afef;">(</span>1000000<span style="color: #51afef;">)</span>;
<span style="color: #5B6268;">//</span><span style="color: #5B6268;">0 will be our initial state</span>

<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">getval</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span><span style="color: #51afef;">)</span>; <span style="color: #5B6268;">//</span><span style="color: #5B6268;">we map each transition to an integer.</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">lst</span> = 1;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">BuildTrie</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">vector</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">string</span><span style="color: #c678dd;">&gt;</span> &amp;<span style="color: #dcaeea;">v</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">for</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">s</span> : v<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #ECBE7B;">char</span> &amp;<span style="color: #dcaeea;">c</span> : s<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #da8548;">(</span>c<span style="color: #da8548;">)</span>;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span><span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">{</span>
                V<span style="color: #a9a1e1;">[</span>lst<span style="color: #a9a1e1;">]</span>.c = c; V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span> = lst++;
                SaveSomeData<span style="color: #a9a1e1;">()</span>;
                <span style="color: #5B6268;">//</span><span style="color: #5B6268;">suppose we save some needed information here</span>
            <span style="color: #da8548;">}</span>
            pos = V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.nxt<span style="color: #da8548;">[</span>val<span style="color: #da8548;">]</span>;
        <span style="color: #98be65;">}</span>
        SaveSomeEndStateData<span style="color: #98be65;">()</span>;
        <span style="color: #5B6268;">//</span><span style="color: #5B6268;">suppose we save some data at the End State</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> <b>Building the rest</b></h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Now we ask ourselves a question, what if in the middle of the pattern
we encounter a character which has no corresponding transition? <br >
Let's think what we did in the KMP, whenever we found a matching
character we simply increased the border by one, the equivalent would be going to the next state. Whenever we found a not matching character we
would compare it to <b>x<sub>x<sub>i</sub></sub></b>. We are going to do the same here, we
are going to find the "Prefix Function" in our Automata.
</p>
</div>
