Algorithms/AhoCorasick/Blog.org
**** *"Prefix Funtion"* in the Trie
Let's think about the *Prefix funtion* again, it said that
*S[0..x_{i}]* was a longest prefix of *S* that was also a suffix of
*S[0..i]*. Now there are multiple strings, how do we generalize this?
Imagine we are looking for the prefix funtion of *S[0..i]*, we would
want to look for the longest Prefix *P* that was also a Suffix of
*S[0..i]*. *P* here must be the pattern needed to go to another state
of the Trie.  It's easy to see that this behaves the same way as the
*prefix function*. So we can write this code:
#+BEGIN_SRC cpp
  int val = getval(V[pos].c);

  int k = V[V[pos].p].SuffixLink;
  while(k > -1 && !V[k].nxt[val]) k = V[k].SuffixLink;
  if(k == -1) V[pos].SuffixLink = 0;
  else {
       V[pos].SuffixLink = V[k].nxt[val];
  }
#+END_SRC

Notice that we now call *x_{i}* the *SuffixLink*, when k = -1, we would
assign 0 but now in a general case we assign *V[k].nxt[val]*; This is
the same as we did before, when we go out of the inner loop we know
that we can increase the border by one, but now we can increase it
with a few different chars, so we simply tell it to point to the one
corresponding to our char.

Something you might have noticed is that we assume that
V[k].SuffixLink has been computed for all the values of V[k]. How can
we assure that? One key idea is that the Prefix pointed by SuffixLink
must be shorter than our current state, as if not it would not be a
proper suffix of the current state, that means that if we build the
Suffix Links by increasing length we would have no problem. Let's do
this by using a bfs.

#+BEGIN_SRC cpp
  void CreateSuffixLink() {
      queue<int> q;
      for(q.push(0); q.size(); q.pop()) {
          int pos = q.front();
          if(!pos) V[pos].SuffixLink = -1;
          else {
              int val = getval(V[pos].c);
              int j = V[V[pos].p].SuffixLink;
              while(j > -1 && !V[j].nxt[val]) j = V[j].SuffixLink;
              if(j == -1) V[pos].SuffixLink = 0;
              else {
                  V[pos].SuffixLink = V[j].nxt[val];
                  SaveSomeSUffixLinkData();
                  //Suppose we want to know some info about out SuffixLink
              }

          }
          for(int i = 0; i < Alpha; ++i) if(V[pos].nxt[i]) q.push(V[pos].nxt[i]);
      }
  }
#+END_SRC

So now we can do the same as the KMP Matching, whenever we fail a
match we can go to its *Prefix function/SuffixLink* and check if we
can increase the border at that point. So our navigating funcion will be:

#+BEGIN_SRC cpp
    void find(string& word) {
        int pos = 0;
        for(auto &c : word) {
            int val = getval(c);
            while(pos > -1 && !V[pos].nxt[val]) pos = V[pos].SuffixLink;
            if(pos == -1) pos = 0;
            else pos = V[pos].nxt[val];
        }
    }
#+END_SRC

Now you might ask what happens if my Suffixlink is a *End state*, how
do I know I have visited it? The answer is easy: in
/SaveSomeSuffixLinkData()/ we save to our state if our suffix link was
an *Ending state*. \\
What if the SuffixLink of the SuffixLink is an
*Ending State*? We have to notice one more property of our
SuffixLinks: If we only follow the SuffixLinks we create a DAG (it's
impossible to have a cycle as SuffixLink only go to shorter strings)
And as the SuffixLink of a SuffixLink is still our Border we will
visit *ALL* borders of our state, hence it is enough if we push up the
Trie if any SuffixLink was an *Ending state*.

Now we have enough Knowledge to implement our first Aho-Corasick Trie:

#+BEGIN_SRC cpp
  struct Trie{
      int lst = 1;
      struct node{
          int nxt[Alpha] = {}, p = -1;
          char c;
          int end = 0;
          //bitset<MaxN> bitmask;
          int SuffixLink;
      };
      vector<node> V;

      inline int getval(char c);

      void CreateSuffixLink() {
          queue<int> q;
          for(q.push(0); q.size(); q.pop()) {
              int pos = q.front();
              if(!pos) V[pos].SuffixLink = -1;
              else {
                  int val = getval(V[pos].c);
                  int j = V[V[pos].p].SuffixLink;
                  while(j > -1 && !V[j].nxt[val]) j = V[j].SuffixLink;
                  if(j == -1) V[pos].SuffixLink = 0;
                  else {
                      V[pos].SuffixLink = V[j].nxt[val];
                      V[pos].end |= V[V[pos].SuffixLink].end;
                  }

              }
              for(int i = 0; i < Alpha; ++i) if(V[pos].nxt[i]) q.push(V[pos].nxt[i]);
          }
      }

      void init(vector<string> &v) {
          V.resize(MaxM);
          int id = 0;
          for(auto &s : v) {
              int pos = 0;
              for(char &c : s) {
                  int val = getval(c);
                  if(!V[pos].nxt[val]) {
                      V[lst].p = pos;
                      V[lst].c = c;
                      V[pos].nxt[val] = lst++;
                  }
                  pos = V[pos].nxt[val];
              }
              V[pos].end = 1;
          }
          CreateSuffixLink();
      }
  };
#+END_SRC

