Algorithms/AhoCorasick/Blog.html

<ol class="org-ol"><li><a id="sec-2-2-2-1" name="sec-2-2-2-1"></a><b>"Prefix Funtion"</b> in the Trie<br ><div class="outline-text-5" id="text-2-2-2-1">
<p>
Let's think about the <b>Prefix funtion</b> again, it said that
<b>S[0..x<sub>i</sub>]</b> was a longest prefix of <b>S</b> that was also a suffix of
<b>S[0..i]</b>. Now there are multiple strings, how do we generalize this?
Imagine we are looking for the prefix funtion of <b>S[0..i]</b>, we would
want to look for the longest Prefix <b>P</b> that was also a Suffix of
<b>S[0..i]</b>. <b>P</b> here must be the pattern needed to go to another state
of the Trie.  It's easy to see that this behaves the same way as the
<b>prefix function</b>. So we can write this code:
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #51afef;">(</span>V<span style="color: #c678dd;">[</span>pos<span style="color: #c678dd;">]</span>.c<span style="color: #51afef;">)</span>;

<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">k</span> = V<span style="color: #51afef;">[</span>V<span style="color: #c678dd;">[</span>pos<span style="color: #c678dd;">]</span>.p<span style="color: #51afef;">]</span>.SuffixLink;
<span style="color: #51afef;">while</span><span style="color: #51afef;">(</span>k &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #c678dd;">[</span>k<span style="color: #c678dd;">]</span>.nxt<span style="color: #c678dd;">[</span>val<span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span> k = V<span style="color: #51afef;">[</span>k<span style="color: #51afef;">]</span>.SuffixLink;
<span style="color: #51afef;">if</span><span style="color: #51afef;">(</span>k == -1<span style="color: #51afef;">)</span> V<span style="color: #51afef;">[</span>pos<span style="color: #51afef;">]</span>.SuffixLink = 0;
<span style="color: #51afef;">else</span> <span style="color: #51afef;">{</span>
     V<span style="color: #c678dd;">[</span>pos<span style="color: #c678dd;">]</span>.SuffixLink = V<span style="color: #c678dd;">[</span>k<span style="color: #c678dd;">]</span>.nxt<span style="color: #c678dd;">[</span>val<span style="color: #c678dd;">]</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Notice that we now call <b>x<sub>i</sub></b> the <b>SuffixLink</b>, when k = -1, we would
assign 0 but now in a general case we assign <b>V[k].nxt[val]</b>; This is
the same as we did before, when we go out of the inner loop we know
that we can increase the border by one, but now we can increase it
with a few different chars, so we simply tell it to point to the one
corresponding to our char.
</p>

<p>
Something you might have noticed is that we assume that
V[k].SuffixLink has been computed for all the values of V[k]. How can
we assure that? One key idea is that the Prefix pointed by SuffixLink
must be shorter than me, as if not it would not be a proper suffix of
my string, that means that if we build the Suffix Links by increasing
length we would have no problem. Let's do this by using a bfs.
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">CreateSuffixLink</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">queue</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">q</span>;
    <span style="color: #51afef;">for</span><span style="color: #c678dd;">(</span>q.push<span style="color: #98be65;">(</span>0<span style="color: #98be65;">)</span>; q.size<span style="color: #98be65;">()</span>; q.pop<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = q.front<span style="color: #98be65;">()</span>;
        <span style="color: #51afef;">if</span><span style="color: #98be65;">(</span><span style="color: #51afef; font-weight: bold;">!</span>pos<span style="color: #98be65;">)</span> V<span style="color: #98be65;">[</span>pos<span style="color: #98be65;">]</span>.SuffixLink = -1;
        <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #da8548;">(</span>V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.c<span style="color: #da8548;">)</span>;
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">j</span> = V<span style="color: #da8548;">[</span>V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.p<span style="color: #da8548;">]</span>.SuffixLink;
            <span style="color: #51afef;">while</span><span style="color: #da8548;">(</span>j &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #a9a1e1;">[</span>j<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span> j = V<span style="color: #da8548;">[</span>j<span style="color: #da8548;">]</span>.SuffixLink;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span>j == -1<span style="color: #da8548;">)</span> V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.SuffixLink = 0;
            <span style="color: #51afef;">else</span> <span style="color: #da8548;">{</span>
                V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.SuffixLink = V<span style="color: #a9a1e1;">[</span>j<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span>;
                SaveSomeSUffixLinkData<span style="color: #a9a1e1;">()</span>;
                <span style="color: #5B6268;">//</span><span style="color: #5B6268;">Suppose we want to know some info about out SuffixLink</span>
            <span style="color: #da8548;">}</span>

        <span style="color: #98be65;">}</span>
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; Alpha; ++i<span style="color: #98be65;">)</span> <span style="color: #51afef;">if</span><span style="color: #98be65;">(</span>V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.nxt<span style="color: #da8548;">[</span>i<span style="color: #da8548;">]</span><span style="color: #98be65;">)</span> q.push<span style="color: #98be65;">(</span>V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.nxt<span style="color: #da8548;">[</span>i<span style="color: #da8548;">]</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
So now we can do the same as the KMP Matching, whenever we fail a
match we can go to its <b>Prefix function/SuffixLink</b> and check if we
can increase the border at that point. So our navigating funcion will be:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">find</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">string</span>&amp; <span style="color: #dcaeea;">word</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
    <span style="color: #51afef;">for</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">c</span> : word<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #98be65;">(</span>c<span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">while</span><span style="color: #98be65;">(</span>pos &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.nxt<span style="color: #da8548;">[</span>val<span style="color: #da8548;">]</span><span style="color: #98be65;">)</span> pos = V<span style="color: #98be65;">[</span>pos<span style="color: #98be65;">]</span>.SuffixLink;
        <span style="color: #51afef;">if</span><span style="color: #98be65;">(</span>pos == -1<span style="color: #98be65;">)</span> pos = 0;
        <span style="color: #51afef;">else</span> pos = V<span style="color: #98be65;">[</span>pos<span style="color: #98be65;">]</span>.nxt<span style="color: #98be65;">[</span>val<span style="color: #98be65;">]</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Now you might ask what happens if my Suffixlink is a <b>End state</b>, how
do I know I have visited it? The answer is easy: in
<i>SaveSomeSuffixLinkData()</i> we save to our state if our suffix link was
an <b>Ending state</b>. <br >
What if the SuffixLink of the SuffixLink is an
<b>Ending State</b>? We have to notice one more property of our
SuffixLinks: If we only follow the SuffixLinks we create a DAG (it's
impossible to have a cycle as SuffixLink only go to shorter strings)
And as the SuffixLink of a SuffixLink is still out Border we will
visit <b>ALL</b> borders of our state, hence it is enough if we push up the
Trie if any SuffixLink was an <b>Ending state</b>.
</p>

<p>
Now we have enough Knowledge to implement our first Aho-Corasick Trie:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">Trie</span><span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">lst</span> = 1;
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">node</span><span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nxt</span><span style="color: #98be65;">[</span>Alpha<span style="color: #98be65;">]</span> = <span style="color: #98be65;">{}</span>, <span style="color: #dcaeea;">p</span> = -1;
        <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">end</span> = 0;
        <span style="color: #5B6268;">//</span><span style="color: #5B6268;">bitset&lt;MaxN&gt; bitmask;</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">SuffixLink</span>;
    <span style="color: #c678dd;">}</span>;
    <span style="color: #ECBE7B;">vector</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">node</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">V</span>;

    <span style="color: #51afef;">inline</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">getval</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span><span style="color: #c678dd;">)</span>;

    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">CreateSuffixLink</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">queue</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">q</span>;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span>q.push<span style="color: #da8548;">(</span>0<span style="color: #da8548;">)</span>; q.size<span style="color: #da8548;">()</span>; q.pop<span style="color: #da8548;">()</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = q.front<span style="color: #da8548;">()</span>;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span><span style="color: #51afef; font-weight: bold;">!</span>pos<span style="color: #da8548;">)</span> V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.SuffixLink = -1;
            <span style="color: #51afef;">else</span> <span style="color: #da8548;">{</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #a9a1e1;">(</span><span style="color: #ECBE7B;">V</span><span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.c<span style="color: #a9a1e1;">)</span>;
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">j</span> = V<span style="color: #a9a1e1;">[</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.p<span style="color: #a9a1e1;">]</span>.SuffixLink;
                <span style="color: #51afef;">while</span><span style="color: #a9a1e1;">(</span>j &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #ECBE7B;">[</span>j<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span> j = V<span style="color: #a9a1e1;">[</span>j<span style="color: #a9a1e1;">]</span>.SuffixLink;
                <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span>j == -1<span style="color: #a9a1e1;">)</span> V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.SuffixLink = 0;
                <span style="color: #51afef;">else</span> <span style="color: #a9a1e1;">{</span>
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.SuffixLink = V<span style="color: #ECBE7B;">[</span>j<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span>;
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.end |= V<span style="color: #ECBE7B;">[</span>V<span style="color: #4db5bd;">[</span>pos<span style="color: #4db5bd;">]</span>.SuffixLink<span style="color: #ECBE7B;">]</span>.end;
                <span style="color: #a9a1e1;">}</span>

            <span style="color: #da8548;">}</span>
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; Alpha; ++i<span style="color: #da8548;">)</span> <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span>V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>i<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span> q.push<span style="color: #da8548;">(</span><span style="color: #ECBE7B;">V</span><span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>i<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span>;
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">init</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">string</span><span style="color: #98be65;">&gt;</span> &amp;<span style="color: #dcaeea;">v</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        V.resize<span style="color: #98be65;">(</span>MaxM<span style="color: #98be65;">)</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">id</span> = 0;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">s</span> : v<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">char</span> &amp;<span style="color: #dcaeea;">c</span> : s<span style="color: #da8548;">)</span> <span style="color: #da8548;">{</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #a9a1e1;">(</span>c<span style="color: #a9a1e1;">)</span>;
                <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span><span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
                    V<span style="color: #ECBE7B;">[</span>lst<span style="color: #ECBE7B;">]</span>.p = pos;
                    V<span style="color: #ECBE7B;">[</span>lst<span style="color: #ECBE7B;">]</span>.c = c;
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span> = lst++;
                <span style="color: #a9a1e1;">}</span>
                pos = V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span>;
            <span style="color: #da8548;">}</span>
            V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.end = 1;
        <span style="color: #98be65;">}</span>
        CreateSuffixLink<span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
</div>
</li></ol>
</div>
