Algorithms/AhoCorasick/Blog.org
*** *Trimming the Code*
Now we have to modify this Trie according to the problem, what if we
dont want to know if some pattern appears but also *How many times
each pattern appears*? The naive idea would be simply going down the
path created by Suffixlinks and add in some vector whenever we go
through some *End State* but that would be too slow. \\
*Remember this property*: If we only follow the SuffixLinks we create a DAG. That
means that we can simply compute the answer lazily, we go through all
the states and store for each state how many times we have been there,
then we can easily calculate how many times we have been in each
state + how many times we would be there using Suffixlinks by
processing in ReverseBfs order.

#+BEGIN_SRC cpp
  struct Trie{
      static const int Alpha = 26;
      int lst = 1;
      struct node{
          int nxt[Alpha] = {}, p = -1;
          char c;
          vector<int> end;
          //bitset<MaxN> bitmask;
          int SuffixLink;
          int cnt = 0;
      };
      vector<node> V;
      int num;
      stack<int> reversebfs;

      inline int getval(char c);

      void CreateSuffixLink() {
          queue<int> q;
          for(q.push(0); q.size(); q.pop()) {
              int pos = q.front();
              reversebfs.push(pos);
              if(!pos) V[pos].SuffixLink = -1;
              else {
                  int val = getval(V[pos].c);
                  int j = V[V[pos].p].SuffixLink;
                  while(j > -1 && !V[j].nxt[val]) j = V[j].SuffixLink;
                  if(j == -1) V[pos].SuffixLink = 0;
                  else {
                      V[pos].SuffixLink = V[j].nxt[val];
                      //V[pos].bitmask |= V[V[pos].SuffixLink].bitmask;
                  }

              }
              for(int i = 0; i < Alpha; ++i) if(V[pos].nxt[i]) q.push(V[pos].nxt[i]);
          }
      }

      void init(vector<string> &v) {
          V.resize(MaxM);
          num = v.size();
          int id = 0;
          for(auto &s : v) {
              int pos = 0;
              for(char &c : s) {
                  int val = getval(c);
                  if(!V[pos].nxt[val]) {
                      V[lst].p = pos; V[lst].c = c; V[pos].nxt[val] = lst++;
                  }
                  pos = V[pos].nxt[val];
              }
              V[pos].end.emplace_back(id++);
          }
          CreateSuffixLink();
      }

      vector<int> find(string& word) {
          int pos = 0;
          vector<int> ans(num, 0);
          for(auto &c : word) {
              int val = getval(c);
              while(pos > -1 && !V[pos].nxt[val]) pos = V[pos].SuffixLink;
              if(pos == -1) pos = 0;
              else pos = V[pos].nxt[val];
              V[pos].cnt++; //We count the times we reach each node, and then do a reverse propagation
          }
          for(;reversebfs.size();reversebfs.pop()) {
              int	x = reversebfs.top(); //When we process x, we know we have been there V[x].cnt times;
              for(int i : V[x].end) ans[i] += V[x].cnt;
              if(V[x].SuffixLink != -1) V[V[x].SuffixLink].cnt += V[x].cnt;
          }
          return ans;
      }
  };
#+END_SRC

And last straight forward optimization we can add is the following: we see that this failure block appears many times:
#+BEGIN_SRC cpp
 while(pos > -1 && !V[pos].nxt[val]) pos = V[pos].SuffixLink;
 if(pos == -1) pos = 0;
 else pos = V[pos].nxt[val];
#+END_SRC

Why don't we simply save this as a transition?

Finally our Aho-Corasick Trie becomes this:

#+BEGIN_SRC cpp
  const int MaxM = 200005;

  struct Trie{
      static const int Alpha = 26;
      static const int first = 'a';
      int lst = 1;
      struct node{
          int nxt[Alpha] = {}, p = -1;
          char c;
          vector<int> end; //if 2 patterns must be different, change to int end = -1;
          int SuffixLink;
          int cnt = 0;
      };
      vector<node> V(MaxM);
      int num;
      stack<int> reversebfs;
      inline int getval(char c) {
          return c - first;
      }

      void CreateSuffixLink() {
          queue<int> q;
          for(q.push(0); q.size(); q.pop()) {
              int pos = q.front();
              reversebfs.push(pos);
              for(int i = 0; i < Alpha; ++i) {
                  if(V[pos].nxt[i]) q.push(V[pos].nxt[i]);
                  else if(!pos || !V[pos].p) {
                      V[pos].SuffixLink = 0;
                      V[pos].nxt[i] = V[0].nxt[i];
                  }
                  else {
                      int val = getval(V[pos].c);
                      int j = V[V[pos].p].SuffixLink;
                      V[pos].SuffixLink = V[j].nxt[val];
                      //We guarantee that V[j].nxt saves all the possible transitions using SuffixLinks
                      V[pos].nxt[i] = V[V[pos].SuffixLink].nxt[i];
                  }
              }
          }
      }

      void init(vector<string> &v) {
          num = v.size();
          int id = 0;
          for(auto &s : v) {
              int pos = 0;
              for(char &c : s) {
                  int val = getval(c);
                  if(!V[pos].nxt[val]) {
                      V[lst].p = pos; V[lst].c = c; V[pos].nxt[val] = lst++;
                  }
                  pos = V[pos].nxt[val];
              }
              V[pos].end.emplace_back(id++);
          }
          CreateSuffixLink();
      }

      vector<int> find(string& word) {
          int pos = 0;
          vector<int> ans(num, 0);
          for(auto &c : word) {
              int val = getval(c);
              pos = V[pos].nxt[val];
              V[pos].cnt++;
              //We count the times we reach each node, and then do a reverse propagation
          }
          for(;reversebfs.size();reversebfs.pop()) {
              int x = reversebfs.top();
              //When we process x, we know we have been there V[x].cnt times;
              for(int i : V[x].end) ans[i] += V[x].cnt;
              if(V[x].SuffixLink != -1) V[V[x].SuffixLink].cnt += V[x].cnt;
          }
          return ans;
      }
  };

#+END_SRC
And the Complexity is O(n+m) \\
Thank you for reading the blog, if anything isn't clear feel free to mail me (At least until I can add some comments to the blog)
Testing Problems: [[http://www.spoj.com/problems/STRMATCH/][SPOJ STRMATCH]], [[http://codeforces.com/gym/101174][SWERC16 Problem E]]
