Algorithms/AhoCorasick/Blog.html

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> <b>Trimming the Code</b></h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Now we have to modify this Trie according to the problem, what if we
dont want to know if some pattern appears but also <b>How many times
each pattern appears</b>? The naive idea would be simply going down the
path created by Suffixlinks and add in some vector whenever we go
through some <b>End State</b> but that would be too slow. <br >
<b>Remember this property</b>: If we only follow the SuffixLinks we create a DAG. That
means that we can simply compute the answer lazily, we go through all
the states and store for each state how many times we have been there,
then we can easily calculate how many times we have been in each
state + how many times we would be there using Suffixlinks by
processing in ReverseBfs order.
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">Trie</span><span style="color: #51afef;">{</span>
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">Alpha</span> = 26;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">lst</span> = 1;
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">node</span><span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nxt</span><span style="color: #98be65;">[</span>Alpha<span style="color: #98be65;">]</span> = <span style="color: #98be65;">{}</span>, <span style="color: #dcaeea;">p</span> = -1;
        <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span>;
        <span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">end</span>;
        <span style="color: #5B6268;">//</span><span style="color: #5B6268;">bitset&lt;MaxN&gt; bitmask;</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">SuffixLink</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">cnt</span> = 0;
    <span style="color: #c678dd;">}</span>;
    <span style="color: #ECBE7B;">vector</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">node</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">V</span>;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">num</span>;
    <span style="color: #ECBE7B;">stack</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">reversebfs</span>;

    <span style="color: #51afef;">inline</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">getval</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span><span style="color: #c678dd;">)</span>;

    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">CreateSuffixLink</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">queue</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">q</span>;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span>q.push<span style="color: #da8548;">(</span>0<span style="color: #da8548;">)</span>; q.size<span style="color: #da8548;">()</span>; q.pop<span style="color: #da8548;">()</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = q.front<span style="color: #da8548;">()</span>;
            reversebfs.push<span style="color: #da8548;">(</span>pos<span style="color: #da8548;">)</span>;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span><span style="color: #51afef; font-weight: bold;">!</span>pos<span style="color: #da8548;">)</span> V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.SuffixLink = -1;
            <span style="color: #51afef;">else</span> <span style="color: #da8548;">{</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #a9a1e1;">(</span><span style="color: #ECBE7B;">V</span><span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.c<span style="color: #a9a1e1;">)</span>;
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">j</span> = V<span style="color: #a9a1e1;">[</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.p<span style="color: #a9a1e1;">]</span>.SuffixLink;
                <span style="color: #51afef;">while</span><span style="color: #a9a1e1;">(</span>j &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #ECBE7B;">[</span>j<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span> j = V<span style="color: #a9a1e1;">[</span>j<span style="color: #a9a1e1;">]</span>.SuffixLink;
                <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span>j == -1<span style="color: #a9a1e1;">)</span> V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.SuffixLink = 0;
                <span style="color: #51afef;">else</span> <span style="color: #a9a1e1;">{</span>
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.SuffixLink = V<span style="color: #ECBE7B;">[</span>j<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span>;
                    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">V[pos].bitmask |= V[V[pos].SuffixLink].bitmask;</span>
                <span style="color: #a9a1e1;">}</span>

            <span style="color: #da8548;">}</span>
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; Alpha; ++i<span style="color: #da8548;">)</span> <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span>V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>i<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span> q.push<span style="color: #da8548;">(</span><span style="color: #ECBE7B;">V</span><span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>i<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span>;
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">init</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">string</span><span style="color: #98be65;">&gt;</span> &amp;<span style="color: #dcaeea;">v</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        V.resize<span style="color: #98be65;">(</span>MaxM<span style="color: #98be65;">)</span>;
        num = v.size<span style="color: #98be65;">()</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">id</span> = 0;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">s</span> : v<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">char</span> &amp;<span style="color: #dcaeea;">c</span> : s<span style="color: #da8548;">)</span> <span style="color: #da8548;">{</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #a9a1e1;">(</span>c<span style="color: #a9a1e1;">)</span>;
                <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span><span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
                    V<span style="color: #ECBE7B;">[</span>lst<span style="color: #ECBE7B;">]</span>.p = pos; V<span style="color: #ECBE7B;">[</span>lst<span style="color: #ECBE7B;">]</span>.c = c; V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span> = lst++;
                <span style="color: #a9a1e1;">}</span>
                pos = V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span>;
            <span style="color: #da8548;">}</span>
            V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.end.emplace_back<span style="color: #da8548;">(</span>id++<span style="color: #da8548;">)</span>;
        <span style="color: #98be65;">}</span>
        CreateSuffixLink<span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #ECBE7B;">vector</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">find</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">string</span>&amp; <span style="color: #dcaeea;">word</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
        <span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">ans</span><span style="color: #98be65;">(</span>num, 0<span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">c</span> : word<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #da8548;">(</span>c<span style="color: #da8548;">)</span>;
            <span style="color: #51afef;">while</span><span style="color: #da8548;">(</span>pos &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span><span style="color: #da8548;">)</span> pos = V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.SuffixLink;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span>pos == -1<span style="color: #da8548;">)</span> pos = 0;
            <span style="color: #51afef;">else</span> pos = V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.nxt<span style="color: #da8548;">[</span>val<span style="color: #da8548;">]</span>;
            V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.cnt++; <span style="color: #5B6268;">//</span><span style="color: #5B6268;">We count the times we reach each node, and then do a reverse propagation</span>
        <span style="color: #98be65;">}</span>
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span>;reversebfs.size<span style="color: #da8548;">()</span>;reversebfs.pop<span style="color: #da8548;">()</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span> = reversebfs.top<span style="color: #da8548;">()</span>; <span style="color: #5B6268;">//</span><span style="color: #5B6268;">When we process x, we know we have been there V[x].cnt times;</span>
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> : V<span style="color: #a9a1e1;">[</span>x<span style="color: #a9a1e1;">]</span>.end<span style="color: #da8548;">)</span> ans<span style="color: #da8548;">[</span>i<span style="color: #da8548;">]</span> += V<span style="color: #da8548;">[</span>x<span style="color: #da8548;">]</span>.cnt;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span>V<span style="color: #a9a1e1;">[</span>x<span style="color: #a9a1e1;">]</span>.SuffixLink != -1<span style="color: #da8548;">)</span> V<span style="color: #da8548;">[</span>V<span style="color: #a9a1e1;">[</span>x<span style="color: #a9a1e1;">]</span>.SuffixLink<span style="color: #da8548;">]</span>.cnt += V<span style="color: #da8548;">[</span>x<span style="color: #da8548;">]</span>.cnt;
        <span style="color: #98be65;">}</span>
        <span style="color: #51afef;">return</span> ans;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
And last straight forward optimization we can add is the following: we see that this failure block appears many times:
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #51afef;">while</span><span style="color: #51afef;">(</span>pos &gt; -1 &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #c678dd;">[</span>pos<span style="color: #c678dd;">]</span>.nxt<span style="color: #c678dd;">[</span>val<span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span> pos = V<span style="color: #51afef;">[</span>pos<span style="color: #51afef;">]</span>.SuffixLink;
<span style="color: #51afef;">if</span><span style="color: #51afef;">(</span>pos == -1<span style="color: #51afef;">)</span> pos = 0;
<span style="color: #51afef;">else</span> pos = V<span style="color: #51afef;">[</span>pos<span style="color: #51afef;">]</span>.nxt<span style="color: #51afef;">[</span>val<span style="color: #51afef;">]</span>;
</pre>
</div>

<p>
Why don't we simply save this as a transition?
</p>

<p>
Finally our Aho-Corasick Trie becomes this:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">MaxM</span> = 200005;

<span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">Trie</span><span style="color: #51afef;">{</span>
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">Alpha</span> = 26;
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">first</span> = <span style="color: #98be65;">'a'</span>;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">lst</span> = 1;
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">node</span><span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nxt</span><span style="color: #98be65;">[</span>Alpha<span style="color: #98be65;">]</span> = <span style="color: #98be65;">{}</span>, <span style="color: #dcaeea;">p</span> = -1;
        <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span>;
        <span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">end</span>; <span style="color: #5B6268;">//</span><span style="color: #5B6268;">if 2 patterns must be different, change to int end = -1;</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">SuffixLink</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">cnt</span> = 0;
    <span style="color: #c678dd;">}</span>;
    <span style="color: #ECBE7B;">vector</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">node</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">V</span><span style="color: #c678dd;">(</span>MaxM<span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">num</span>;
    <span style="color: #ECBE7B;">stack</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">reversebfs</span>;
    <span style="color: #51afef;">inline</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">getval</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">c</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">return</span> c - first;
    <span style="color: #c678dd;">}</span>

    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">CreateSuffixLink</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">queue</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">q</span>;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span>q.push<span style="color: #da8548;">(</span>0<span style="color: #da8548;">)</span>; q.size<span style="color: #da8548;">()</span>; q.pop<span style="color: #da8548;">()</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = q.front<span style="color: #da8548;">()</span>;
            reversebfs.push<span style="color: #da8548;">(</span>pos<span style="color: #da8548;">)</span>;
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; Alpha; ++i<span style="color: #da8548;">)</span> <span style="color: #da8548;">{</span>
                <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>i<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span> q.push<span style="color: #a9a1e1;">(</span><span style="color: #ECBE7B;">V</span><span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>i<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span>;
                <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span><span style="color: #51afef; font-weight: bold;">!</span>pos || <span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.p<span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.SuffixLink = 0;
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>i<span style="color: #ECBE7B;">]</span> = V<span style="color: #ECBE7B;">[</span>0<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>i<span style="color: #ECBE7B;">]</span>;
                <span style="color: #a9a1e1;">}</span>
                <span style="color: #51afef;">else</span> <span style="color: #a9a1e1;">{</span>
                    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #ECBE7B;">(</span><span style="color: #ECBE7B;">V</span><span style="color: #4db5bd;">[</span>pos<span style="color: #4db5bd;">]</span>.c<span style="color: #ECBE7B;">)</span>;
                    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">j</span> = V<span style="color: #ECBE7B;">[</span>V<span style="color: #4db5bd;">[</span>pos<span style="color: #4db5bd;">]</span>.p<span style="color: #ECBE7B;">]</span>.SuffixLink;
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.SuffixLink = V<span style="color: #ECBE7B;">[</span>j<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span>;
                    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">We guarantee that V[j].nxt saves all the possible transitions using SuffixLinks</span>
                    V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>i<span style="color: #ECBE7B;">]</span> = V<span style="color: #ECBE7B;">[</span>V<span style="color: #4db5bd;">[</span>pos<span style="color: #4db5bd;">]</span>.SuffixLink<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>i<span style="color: #ECBE7B;">]</span>;
                <span style="color: #a9a1e1;">}</span>
            <span style="color: #da8548;">}</span>
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">init</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">string</span><span style="color: #98be65;">&gt;</span> &amp;<span style="color: #dcaeea;">v</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        num = v.size<span style="color: #98be65;">()</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">id</span> = 0;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">s</span> : v<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">char</span> &amp;<span style="color: #dcaeea;">c</span> : s<span style="color: #da8548;">)</span> <span style="color: #da8548;">{</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #a9a1e1;">(</span>c<span style="color: #a9a1e1;">)</span>;
                <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span><span style="color: #51afef; font-weight: bold;">!</span>V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
                    V<span style="color: #ECBE7B;">[</span>lst<span style="color: #ECBE7B;">]</span>.p = pos; V<span style="color: #ECBE7B;">[</span>lst<span style="color: #ECBE7B;">]</span>.c = c; V<span style="color: #ECBE7B;">[</span>pos<span style="color: #ECBE7B;">]</span>.nxt<span style="color: #ECBE7B;">[</span>val<span style="color: #ECBE7B;">]</span> = lst++;
                <span style="color: #a9a1e1;">}</span>
                pos = V<span style="color: #a9a1e1;">[</span>pos<span style="color: #a9a1e1;">]</span>.nxt<span style="color: #a9a1e1;">[</span>val<span style="color: #a9a1e1;">]</span>;
            <span style="color: #da8548;">}</span>
            V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.end.emplace_back<span style="color: #da8548;">(</span>id++<span style="color: #da8548;">)</span>;
        <span style="color: #98be65;">}</span>
        CreateSuffixLink<span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #ECBE7B;">vector</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">find</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">string</span>&amp; <span style="color: #dcaeea;">word</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">pos</span> = 0;
        <span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">ans</span><span style="color: #98be65;">(</span>num, 0<span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #51afef;">auto</span> &amp;<span style="color: #dcaeea;">c</span> : word<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = getval<span style="color: #da8548;">(</span>c<span style="color: #da8548;">)</span>;
            pos = V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.nxt<span style="color: #da8548;">[</span>val<span style="color: #da8548;">]</span>;
            V<span style="color: #da8548;">[</span>pos<span style="color: #da8548;">]</span>.cnt++;
            <span style="color: #5B6268;">//</span><span style="color: #5B6268;">We count the times we reach each node, and then do a reverse propagation</span>
        <span style="color: #98be65;">}</span>
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span>;reversebfs.size<span style="color: #da8548;">()</span>;reversebfs.pop<span style="color: #da8548;">()</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span> = reversebfs.top<span style="color: #da8548;">()</span>;
            <span style="color: #5B6268;">//</span><span style="color: #5B6268;">When we process x, we know we have been there V[x].cnt times;</span>
            <span style="color: #51afef;">for</span><span style="color: #da8548;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> : V<span style="color: #a9a1e1;">[</span>x<span style="color: #a9a1e1;">]</span>.end<span style="color: #da8548;">)</span> ans<span style="color: #da8548;">[</span>i<span style="color: #da8548;">]</span> += V<span style="color: #da8548;">[</span>x<span style="color: #da8548;">]</span>.cnt;
            <span style="color: #51afef;">if</span><span style="color: #da8548;">(</span>V<span style="color: #a9a1e1;">[</span>x<span style="color: #a9a1e1;">]</span>.SuffixLink != -1<span style="color: #da8548;">)</span> V<span style="color: #da8548;">[</span>V<span style="color: #a9a1e1;">[</span>x<span style="color: #a9a1e1;">]</span>.SuffixLink<span style="color: #da8548;">]</span>.cnt += V<span style="color: #da8548;">[</span>x<span style="color: #da8548;">]</span>.cnt;
        <span style="color: #98be65;">}</span>
        <span style="color: #51afef;">return</span> ans;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;

</pre>
</div>
<p>
And the Complexity is O(n+m) <br >
Testing Problems: <a href="http://www.spoj.com/problems/STRMATCH/">SPOJ STRMATCH</a>, <a href="http://codeforces.com/gym/101174">SWERC16 Problem E</a>
</p>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. <b>String Matching and KMP</b></a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. <b>Naive Solution</b></a></li>
<li><a href="#sec-1-2">1.2. <b>KMP O(n) Solution</b></a>
<ul class="nav">
<li><a href="#sec-1-2-1">1.2.1. <b>Prefix function</b></a></li>
<li><a href="#sec-1-2-2">1.2.2. <b>KMP</b></a></li>
<li><a href="#sec-1-2-3">1.2.3. <b>Complexity Analysis</b></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. <b>String Matching and AhoCorasick</b></a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. <b>Naive Solution</b></a></li>
<li><a href="#sec-2-2">2.2. <b>Generalizaing the KMP algorithm</b></a>
<ul class="nav">
<li><a href="#sec-2-2-1">2.2.1. <b>Building the skeleton</b></a></li>
<li><a href="#sec-2-2-2">2.2.2. <b>Building the rest</b></a></li>
<li><a href="#sec-2-2-3">2.2.3. <b>Trimming the Code</b></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Dean Zhu</p>
<p class="email">Email: <a href="mailto:deanzhu2@gmail.com">deanzhu2@gmail.com</a></p>
</div>
</footer>
</body>
</html>
